; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image2 - mode
	spectrograph0 - mode
	image1 - mode
	thermograph3 - mode
	Star2 - direction
	Star3 - direction
	Star4 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation1 - direction
	Star0 - direction
	GroundStation7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 spectrograph0)
	(supports instrument1 image2)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
)
(:goal (and
	(pointing satellite0 GroundStation5)
	(have_image Star8 thermograph3)
	(have_image Planet9 spectrograph0)
	(have_image Phenomenon10 thermograph3)
	(have_image Planet11 thermograph3)
	(have_image Planet12 image1)
	(have_image Planet13 image2)
	(have_image Phenomenon14 image1)
	(have_image Phenomenon15 image2)
	(have_image Planet16 image2)
	(have_image Phenomenon17 spectrograph0)
	(have_image Star18 image2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 12
2. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 12
3. (turn_to satellite0 planet12 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet12)
   goals met: 0 of 12
4. (take_image satellite0 planet12 instrument0 image1)
   added: (have_image planet12 image1)
   goals met: 1 of 12
5. (turn_to satellite0 phenomenon14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 12
6. (take_image satellite0 phenomenon14 instrument0 image1)
   added: (have_image phenomenon14 image1)
   goals met: 2 of 12
7. (turn_to satellite0 groundstation7 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 groundstation7)
   goals met: 2 of 12
8. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 2 of 12
9. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 12
10. (calibrate satellite0 instrument1 groundstation7)
   added: (calibrated instrument1)
   goals met: 2 of 12
11. (turn_to satellite0 phenomenon10 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 12
12. (take_image satellite0 phenomenon10 instrument1 thermograph3)
   added: (have_image phenomenon10 thermograph3)
   goals met: 3 of 12
13. (turn_to satellite0 phenomenon15 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon15)
   goals met: 3 of 12
14. (take_image satellite0 phenomenon15 instrument1 image2)
   added: (have_image phenomenon15 image2)
   goals met: 4 of 12
15. (turn_to satellite0 phenomenon17 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon17)
   goals met: 4 of 12
16. (take_image satellite0 phenomenon17 instrument1 spectrograph0)
   added: (have_image phenomenon17 spectrograph0)
   goals met: 5 of 12
17. (turn_to satellite0 planet11 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet11)
   goals met: 5 of 12
18. (take_image satellite0 planet11 instrument1 thermograph3)
   added: (have_image planet11 thermograph3)
   goals met: 6 of 12
19. (turn_to satellite0 planet13 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet13)
   goals met: 6 of 12
20. (take_image satellite0 planet13 instrument1 image2)
   added: (have_image planet13 image2)
   goals met: 7 of 12
21. (turn_to satellite0 planet16 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet16)
   goals met: 7 of 12
22. (take_image satellite0 planet16 instrument1 image2)
   added: (have_image planet16 image2)
   goals met: 8 of 12
23. (turn_to satellite0 planet9 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet9)
   goals met: 8 of 12
24. (take_image satellite0 planet9 instrument1 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 9 of 12
25. (turn_to satellite0 star18 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star18)
   goals met: 9 of 12
26. (take_image satellite0 star18 instrument1 image2)
   added: (have_image star18 image2)
   goals met: 10 of 12
27. (turn_to satellite0 star8 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star8)
   goals met: 10 of 12
28. (take_image satellite0 star8 instrument1 thermograph3)
   added: (have_image star8 thermograph3)
   goals met: 11 of 12
29. (turn_to satellite0 groundstation5 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation5)
   goals met: 12 of 12
